glocklueng/032/LayerOne_2014/badge/code/stm32-prox/ssd1306/ssd1306.c
        DelayuS(50);
}

static void OLEDSpiSendByte(unsigned char byte)
{
  unsigned char  i ;
  unsigned char  tbyte = byte ;       
  
  LCD_SCLK_HIGH( );
  
  for(i = 0 ; i < 8 ; i++) {
	 
	if( tbyte & 0x80 ) {            
	  LCD_SDIN_HIGH() ;                       
	} else {
	  LCD_SDIN_LOW() ;         
	}
	
	LCD_SCLK_LOW() ;                    
	LCD_SCLK_HIGH( );  
	
	tbyte  <<= 1;           
  }
}

void InitOLED( void )
{
  
  u8CursorX = 0;
  u8CursorY = 0;
  
  memset(sVideoRAM,0,sizeof(sVideoRAM));
  
  // Fill in the prefix command byte on each page line of the display buffer
  // We can do it during initialisation as this byte is never overwritten.
  
#ifdef SSD1306_PAGE_PREFIX
  {
    unsigned	i;
    
    for(i=0; i < GDISP_SCREEN_HEIGHT/8 * SSD1306_PAGE_WIDTH; i+=SSD1306_PAGE_WIDTH)
      RAM(g)[i] = SSD1306_PAGE_PREFIX;
  }
#endif
  DelaymS(500);
  OLEDInit();
  
  OLEDClear();
  OLEDDraw();		
}

void OLEDClear( void ) 
{
  // Reset Cursor  
  u8CursorX = 0;
  u8CursorY = 0;
  
  memset(sVideoRAM,0,sizeof(sVideoRAM));
}

/*-------------------------------------------------------------------------------
Send instruction to the LCD
	LcdInstructionWrite (uint8_t u8Instruction)
		u8Instruction = Instruction to send to the LCDCHSIZE 2 2469
-------------------------------------------------------------------------------*/
void LcdInstructionWrite (unsigned char u8Instruction)
{
  GPIO_WriteBit(OLED_PORT,CS_PIN,Bit_RESET);			// Select
  GPIO_WriteBit(OLED_PORT,DC_PIN,Bit_RESET);             // Instruction mode
	
  OLEDSpiSendByte(u8Instruction);  
}

void InvertOLED( unsigned char state ) 
{
  LcdInstructionWrite(state?SSD1306_INVERTDISPLAY:SSD1306_NORMALDISPLAY);
}

void OLEDInit(void)	
{
  int y;
  
  unsigned short test;
  unsigned short test2;
  
  // Recommended power up sequence
  OLEDSpiInit();
  DelayuS(4);
  
  GPIO_WriteBit(OLED_PORT,RES_PIN,Bit_RESET); 
  DelayuS(4);
  
  GPIO_WriteBit(OLED_PORT,RES_PIN,Bit_SET); 
  DelayuS(4);
  
  // Recommended initialization sequence
  LcdInstructionWrite(LCD_DISP_OFF);
  LcdInstructionWrite(LCD_SET_RATIO_OSC);
  LcdInstructionWrite(0x80);
  LcdInstructionWrite(LCD_MULTIPLEX);
  LcdInstructionWrite(0x3F);
  LcdInstructionWrite(LCD_SET_OFFSET);
  LcdInstructionWrite(0x00);
  LcdInstructionWrite(LCD_SET_LINE);
  LcdInstructionWrite(LCD_CHARGE_PUMP);
  LcdInstructionWrite(LCD_PUMP_ON);
  
  //set at main LcdInstructionWrite(LCD_SET_SEG_REMAP1);
  //set at main LcdInstructionWrite(LCD_SET_SCAN_NOR);
  LcdInstructionWrite(LCD_SET_PADS);
  LcdInstructionWrite(0x12);
  LcdInstructionWrite(LCD_SET_CONTRAST);
  LcdInstructionWrite(0xFF);
  LcdInstructionWrite(LCD_SET_CHARGE);
  LcdInstructionWrite(0xF1);
  LcdInstructionWrite(LCD_SET_VCOM);
  LcdInstructionWrite(0x40);
  LcdInstructionWrite(LCD_EON_OFF);
  LcdInstructionWrite(LCD_DISP_NOR);
  LcdInstructionWrite(LCD_SET_SEG_REMAP1);
  LcdInstructionWrite(LCD_SET_SCAN_NOR);
  LcdInstructionWrite(LCD_MEM_ADDRESSING);
  LcdInstructionWrite(0x00);          // Horizontal Addressing mode
  LcdInstructionWrite(LCD_DISP_ON);
  
  test2 = 40;
  
  while( test2--  ) {
    
    test = 100;
    
    while( test-- )  {
      
      OLEDSetPixel(rand()%128,rand()%64,rand()%2);
    }
    OLEDDraw();
    OLEDClear();
  }
  
  DelaymS( 500 );
  
  // Push cleared buffer
  OLEDDraw();
  
  
  OLEDPutstr("LAYERONE 2014 PROTOTYPE\n");
  OLEDDraw();
  
  OLEDPutstr("OLED TEST\n");
  OLEDDraw();
  
  for( y = 0 ; y < 10 ; y++ ) {
    
    InvertOLED(1);
    DelaymS(10*y);
    InvertOLED(0);
    DelaymS(10*y);
  }
  
  OLEDPutstr("AUDIO TEST\n");
  OLEDDraw();
  
  for( y=0;y<400;y++ ) {
    SetSpeaker( y * 100 );
  }
  
  while(y--){	
    SetSpeaker( y * 100 );
  }
  
  OLEDPutstr("LED TEST\n");
  OLEDDraw();
  
  for( y=0;y<20;y++ ) {
    
    LEDSet( 1 );
    DelaymS(10*y);
    LEDSet(0);		
    DelaymS(10*y);
  }
  
  OLEDPutstr("RELAY TEST\n");
  OLEDDraw();
  
  LEDSet( 1 );
  HIGH( RELAY );
  DelaymS(500);
  
  LEDSet( 0 );
  LOW ( RELAY );
  DelaymS( 500 );
  
  LEDSet( 1 );
  HIGH( RELAY );
  DelaymS(500);
  
  LEDSet( 0 );
  LOW ( RELAY );
  DelaymS(700);
  
  OLEDPutstr("DONE\n");
  OLEDDraw();
  
}

void OLEDDraw(void) 
{
  unsigned short i;
  
  LcdInstructionWrite(LCD_SET_COL_LO | 0x0);  
  LcdInstructionWrite(LCD_SET_COL_HI | 0x0); 
  LcdInstructionWrite(SSD1306_SETSTARTLINE | 0x0); 
  
  GPIO_WriteBit(OLED_PORT,CS_PIN,Bit_SET);			// Select
  GPIO_WriteBit(OLED_PORT,DC_PIN,Bit_SET);             // Instruction mode
  GPIO_WriteBit(OLED_PORT,CS_PIN,Bit_RESET);			// Select
  
  for ( i=0; i<(GDISP_SCREEN_WIDTH*GDISP_SCREEN_HEIGHT/8); i++) {
	OLEDSpiSendByte(sVideoRAM[i]);
  }
  // i wonder why we have to do this (check datasheet)
  if (GDISP_SCREEN_HEIGHT == 32) {
	for (unsigned short i=0; i<(GDISP_SCREEN_WIDTH*GDISP_SCREEN_HEIGHT/8); i++) {
	  OLEDSpiSendByte(0);
	}
  }
  
  GPIO_WriteBit(OLED_PORT,CS_PIN,Bit_SET);
}

void OLEDSetPixel(unsigned char x, unsigned char y, unsigned char color) 
{
  if ((x >= GDISP_SCREEN_WIDTH) || (y >= GDISP_SCREEN_HEIGHT) )
    return;
 
  // HARDWARE DOES THIS
  //x = x - (GDISP_SCREEN_WIDTH-1);
  //y = (GDISP_SCREEN_HEIGHT-1) -  y;
 
  // x is which column
  if (color ) 
    sVideoRAM[x+ (y/8)*GDISP_SCREEN_WIDTH] |= _BV((y%8));  
  else
    sVideoRAM[x+ (y/8)*GDISP_SCREEN_WIDTH] &= ~_BV(((y%8))); 
}

/**
 *     Plots a point (slow routine). 0,0 is the screen center instead of usual top left as 0,0
 *
 * @param x,y			- coordinates of point to plot
 * @param colour		- colour to use
 */
void	OLEDPixelQuad( int x, int y, unsigned char colour )
{
	OLEDSetPixel(x  ,y  , colour);
	OLEDSetPixel(x+1,y  , colour);
	OLEDSetPixel(x+1,y+1, colour);
	OLEDSetPixel(x  ,y+1, colour);
}

void FlushOLED( void )
{
}

// put byte on display buffer
// for this to flip properly, needs 7-y, width-x and data to be reversed
void write_display(unsigned char data) 
{  
  sVideoRAM[((unsigned short )((u8CursorY)<<7)) + u8CursorX++] = data;
}

/*-------------------------------------------------------------------------------
	Print a char on the LCD
		OLEDBigchar (unsigned char u8Char)
			u8Char = char to display
-------------------------------------------------------------------------------*/
void OLEDBigchar (unsigned char u8Char) 
{
	
  unsigned char  i=0;
    uint16_t *pointer;
	
	if(u8Char=='.') {           // Small point to Save space
		write_display (0x60);
		write_display (0x60);
		u8CursorX+=2;
	}
	else if(u8Char=='-') {      // Negative sign
		write_display (0x03);
		write_display (0x03);
		write_display (0x03);
		write_display (0x03);
		u8CursorX+=2;
    }
	else if(u8Char==' ') {      // Space
		u8CursorX+=6;
    }
	else {                      // Number
	  
		pointer = (uint16_t*)BigFonts[u8Char*20];
		// Upper side
		u8CursorY--;
		
		while (i < 10) { 
		  
		  write_display ( *pointer) ;
		  pointer++ ; 
		  i++; 
		}
		
		i=0;
		// Lower Side
		u8CursorY++;
		u8CursorX-=10;
		while (i < 10) { 
		  write_display(*pointer); 
			pointer++;i++; 
		}
       		 u8CursorX+=2;
	}
}

void OLEDPutchar(char u8Char) 
{
  uint8_t *pointer;
  uint8_t data,u8CharColumn=0;
  pointer = (uint8_t*)(Fonts)+(u8Char-22)*(3);
  
  /* Draw a char */
  while (u8CharColumn < 3)	{
    
