glocklueng/032/LayerOne_2014/badge/code/stm32-prox/ssd1306/ssd1306.c
    data = (*pointer++);
    
    if(testbit(Misc,NEGATIVE)) 
      data = ~(data|128);
    
    write_display(data);
    
    u8CharColumn++;
  }
  
  // Special characters
  if(u8Char==0x1C) {       // Begin long 'd' character
    write_display(0x30);
  }
  else if(u8Char==0x1D) {  // Complete long 'd' character
    write_display(0x38);
    u8CursorX++;
  }
  else if(u8Char==0x1A) {  // Complete long 'm' character
    write_display(0x08);
  }
  else if(u8CursorX < 128) {  // if not then insert a space before next letter
    data = 0;
    if(testbit(Misc,NEGATIVE)) data = 127;
    write_display(data);
  }
  if(u8CursorX>=128) {    // Next line
    u8CursorX = 0; 
    u8CursorY++;
  }
}

void OLEDPutstr (const char *ptr)
{    
  char c;
  
  if( u8CursorY > 6 ) 
    u8CursorY = 0 ;
  
  while ((c=*(ptr++)) != 0x00) {
    if( c == '\n' ){
      u8CursorX = 0;
      u8CursorY++;
    }else
      if( c == '\r' ){
	u8CursorX = 0;
      }else  {
	OLEDPutchar(c);
      }
  }
}

void OLEDPutBigstr (const char *ptr)
{    
  char c;
  
  while ((c=*(ptr++)) != 0x00) {
	if( c == '\n' ){
	  u8CursorX = 0;
	  u8CursorY++;
	}else
	if( c == '\r' ){
	  u8CursorX = 0;
	}else  {
		OLEDBigchar(c);
	}
  }
}

/*-------------------------------------------------------------------------------
Send an image to the LCD
	OLEDDisplayPicture (uint8_t *au8PictureData)
		au8PictureData = contains encoded data for picture

	Decode:
	Get one byte, put it to the output file, and now it's the 'last' byte. 
	Loop 
	Get one byte 
	Is the current byte equal to last? 
	Yes 
		Now get another byte, this is 'counter' 
		Put current byte in the output file 
		Copy 'counter' times the 'last' byte to the output file 
		Put last copied byte in 'last' (or leave it alone) 
	No 
		Put current byte to the output file 
		Now 'last' is the current byte 
	Repeat. 
-------------------------------------------------------------------------------*/
void OLEDDisplayPicture (const uint8_t *pointer) 
{
	uint8_t data=0, count=0;
    uint16_t i;
    uint8_t *p;
    
	p = sVideoRAM;
	
  	for (i = 0; i < 1024; i++) {
        if(count==0) {
			data = *(pointer++);
			if(data==*(pointer++)) {
				count = *(pointer++);
			}
			else {
				count = 1;
				pointer--;
			}
		}
		count--;
        *p++ = data;
	}
}

void OLEDDrawXY( int x,int y )
{
  
}

// Graphs
unsigned char graphx[ GDISP_SCREEN_WIDTH ] ;

void OLEDDrawGraph( void )
{
  int x;
  
  for (  x =0 ; x < GDISP_SCREEN_WIDTH ; x ++ ) {
 
    	OLEDSetPixel(x,graphx[x],1);
  }
}

void OLEDSetCursor( int x,int y )
{
  u8CursorX = x;
  u8CursorY = y;
}

/**
 * Compute outcodes for clipper.
 */
static int BuildOutcodes(int x, int y)
{
	register int code = 0;

	if( y >= m_clip_y_max ) 
	  code |= 1;		// top
	else if( y < m_clip_y_min ) code |= 2;	// bottom
	if( x >= m_clip_x_max ) code |= 4;		// right
	else if ( x < m_clip_x_min ) code |= 8; // left

	return(code);
}
 
char clipLine(int x1, int y1, int x2, int y2, 
	      int *x3, int *y3, int *x4, int *y4)
{
    int code1, code2, codeout;
    bool accept = false, done = false ;

	//the region outcodes for the endpoints
    code1 = BuildOutcodes(x1, y1); 
    code2 = BuildOutcodes(x2, y2);
	
//In theory, this can never end up in an infinite loop, it'll always come in one of the trivial cases eventually
    do {
		//accept because both endpoints are in screen or on the border, trivial accept
		if(!(code1 | code2)) {
			accept = done = 1;
		} else if(code1 & code2) { 
			//the line isn't visible on screen, trivial reject
			done = 1; 
		//if no trivial reject or accept, continue the loop
		} else  {

            int x, y;
            
			codeout = code1 ? code1 : code2;
            
			if(codeout & 1) //top
            {
                x = x1 + (x2 - x1) * (m_clip_y_max - y1) / (y2 - y1);
                y = m_clip_y_max - 1;
            }
            else if(codeout & 2) //bottom
            {
                x = x1 + (x2 - x1) * -y1 / (y2 - y1);
                y = 0;
            }
            else if(codeout & 4) //right
            {
                y = y1 + (y2 - y1) * (m_clip_x_max - x1) / (x2 - x1);
                x = m_clip_x_max - 1;
            }
            else //left
            {
                y = y1 + (y2 - y1) * -x1 / (x2 - x1);
                x = 0;
            }
           if(codeout == code1) //first endpoint was clipped
            {
                x1 = x; y1 = y;
                code1 = BuildOutcodes(x1, y1);
            }
            else //second endpoint was clipped
            {
                x2 = x; y2 = y;
                code2 = BuildOutcodes(x2, y2);
            }
        }
	} while( done == 0 );
   
	if( accept ) {

        *x3 = x1;
        *x4 = x2;
        *y3 = y1;
        *y4 = y2;

        return 1;

    } else {

        x3 = x4 = y3 = y4 = 0;
        
		return 0;
    }
}
 

void OLEDLine(int x0, int y0, int x1, int y1,int col) 
{
  int step = abs(y1 - y0) > abs(x1 - x0) ;
  int t;
  
  if (step) {
    t = x0; x0 = y0; y0 = t;
    t = x1; x1 = y1; y1 = t;
  }
 
  if (x0 > x1) {
    t = x0; x0 = x1; x1 = t;
    t = y0; y0 = y1; y1 = t;
  }
 
  int dx, dy;
  
  dx = x1 - x0;
  dy = abs(y1 - y0);
 
  int err = dx / 2;
  int ystep;
 
  if (y0 < y1) {
    ystep = 1;
  } else {
    ystep = -1;}
 
  for (; x0<x1; x0++) {
    if (step) {
      OLEDSetPixel(y0, x0,col);
    } else {
      OLEDSetPixel(x0, y0,col);
    }
    err -= dy;
    if (err < 0) {
      y0 += ystep;
      err += dx;
    }
  }
}
 
/** 
 * Draw an 8 bit string using the builtin 8x6 font (this font is always available)  possibly using transparency
 *
 * @param x     - X position on screen, will be clipped.
 * @param y     - Y position on screen, will be clipped.
 * @param string- 8 bit ASCIZ string
 * @param f_colour - foreground colour to use 0/1
 * @param b_colour - background colour to use 0/1
 */
void OLEDText8x6(short x,short y,const char *string,unsigned char f_colour, unsigned char b_colour)
{
  short nm,i,j,oldx=x;
  unsigned char  cur;
  int l_adr;
  int l=0;
  
  if( x == -1 ) {
    // center it
    x =  ( (SCREEN_WIDTH/2)-((strlen(string) * 7)/2) );
  }
  
  while(*string!='\0')										/* until the end of the string */
  {
    if(*string=='\n'){
      x=oldx;y+=7;
      l=0;
      string++;
    }
    
