glocklueng/032/LayerOne_2014/badge/code/stm32-prox/ssd1306/ssd1306.c
    nm=((*string++)-' ');									/* Starting from space */
    
    if( nm > 58 ) 
      nm-=' ';											/* to uppercase 58='Z'-' ' */
    nm *= 6;											/* 6 bytes per char */
    
    for(i=0,l_adr=0;i<6;i++,l_adr++)
    {
      cur=font8x6[nm++];
      
      for(j=0;j<8;j++) {
	if(cur&(0x80>>j)) {
	  OLEDSetPixel(x+j+l,y+i,f_colour);
	} else {
	  // if both colours match make it transparent
	  if( f_colour != b_colour ) {
	    OLEDSetPixel(x+j+l,y+i,b_colour);
	  }
	}
      }
    }
    //adr+=7;               
    l+=7;/* Next word */
  }
}

/** 
 * Draw an 8 bit string using the builtin 6x6 font (this font is always available)  possibly using transparency
 *
 * @param x     - X position on screen, will be clipped.
 * @param y     - Y position on screen, will be clipped.
 * @param string- 8 bit ASCIZ string
 * @param f_colour - foreground colour to use
 * @param b_colour - background colour to use (if fore and back same colour, draw transparent)
 */
void OLEDText6x6(short x,short y,const char *string,char f_colour,char b_colour )
{
	short nm,i,j,oldx=x;
	unsigned char  cur;
	int l = 0;
	
	
	while(*string!='\0')										/* until the end of the string */
	{
		
		if(*string=='\n') {
			x=oldx;
			y+=6;
			string++;
		} else {
			
			nm=((*string++)-' ');                     /* Starting from space */
			
			if(nm>58) nm-=' ';                        /* to uppercase 58='Z'-' ' */
			nm*=6;                                    /* 6 bytes per char */
			for(i=0;i<6;i++)
			{
				cur=font6x6[nm++];
				for(j=0;j<6;j++) {
					if(cur&(0x80>>j)) {
						OLEDSetPixel(x+j+l,y+i,f_colour);
					} else {
													/* if both colours match make it transparent */
						if( f_colour != b_colour ) {
							OLEDSetPixel(x+j+l,y+i,b_colour);
						}
					}
				}
			}
			l+=5;                                   /* Next word */
		}
	}
}

/**
 *   Draw a horizontal line 
 *
 * @param colour - colour
 * @param x		  - x position
 * @param length	  - line length
 * @param y		  - y position
 *
 */
void OLEDFlatLine( unsigned char colour,short x,unsigned short length,int y)
{
	unsigned short i;
	
	for( i = 0 ; i < length ; i++ ) {
		OLEDSetPixel( x+i, y, colour );
	}
}

/**
 *	Draw a filled solid colour rectangle
 *
 * @param us_colour - colour
 * @param x		 - x position
 * @param y		 - y position
 * @param width	 - rect width
 * @param height - rect height
 *
 */
void OLEDFilledRect(unsigned char colour, int x,int y, unsigned int width,unsigned int height)
{
  unsigned int i;
  int diff;
  int w,h;
  
  // if completely offscreen
  if ( (signed) (x + width) < 0  ) {
    return;
  }
  if ((signed)( y + height )< 0  ) {
    return;
  }
  
  // Calculate width from base
  if ( x < 0 ) {
    diff = 0 -x ;
    
    width = w  = width  - diff;
    if ( w < 1 ) 
      return ;
    
    x = 0;
  }
  
  if ( y < 0 ) {
    diff = 0 - y ;
    
    height = h  = height - diff;
    if( h< 1 ) 
      return;
    
    y = 0;
  }
  
  height = MIN((height+y),m_clip_y_max-1);
  
  
  for( int j=y;j<height;j++) {
    for( i = 0 ; i < width ; i++ ) {
      
      OLEDSetPixel( x+i, j, colour );
    }
  }
}


/**
 *	Draw an outlined single colour rectangle as a frame
 *
 * @param colour    - colour
 * @param x		 - x position
 * @param y		 - y position
 * @param width	 - frame rect width
 * @param height	 - frame rect height
 *
 */
void OLEDOutlineRect(unsigned char colour, int x,int y, int width,int height)
{
	int i;
	
	if( height <1 ) 
		return ;
	if( width <1 ) 
		return ;

	OLEDFlatLine(colour,x,width,y);

	for( i=y+1;i<y+(height-1);i++) {
		OLEDSetPixel(x,i,colour);
		OLEDSetPixel(x+(width-1),i,colour);
	}

	OLEDFlatLine(colour,x,width,y+(height-1));
}

#define fill_circle(x,y,c) x1 = xc - x; x2 = xc + x; OLEDFlatLine(c,x1,x2-x1,y);


/**
 *	Draw a filled single colour circle 
 *
 * @param colour    - colour
 * @param xc	    - x centre position
 * @param yc		- y centre position
 * @param radius	- radius of circle
 * @param c			- RGB colour
 *
 */

void DrawCircle( int xc,int yc, unsigned int radius , unsigned char c )
{
	int x, y, p;
	int x1,x2;
	
	if (radius < 1) {
		return;	
	}

	x = 0;
	y = radius;
	p = 3-2*radius;

	while ( x <= y ) {

		fill_circle(x,yc+y,c);
		fill_circle(x,yc-y,c);
		fill_circle(y,yc+x,c);
		fill_circle(y,yc-x,c);
		
		if (p < 0) {
			p = p + 4 * x + 6;
		} else {
			p = p + 4 * ( x - y ) + 10;
			y --;
		}
		
		x++;
	}
}
#define fill_circlea(x,y,c) x1 = xc - x; x2 = xc + x; OLEDFlatLine(c,x1,x2-x1,y);


/**
 *	Draw a filled single colour circle 
 *
 * @param colour    - colour
 * @param xc	    - x centre position
 * @param yc		- y centre position
 * @param radius	- radius of circle
 * @param c			- RGB colour
 *
 */

void OLEDDrawCircle( int xc,int yc, unsigned int radius , unsigned char c)
{
	int x, y, p;
	int x1,x2;
	
	if (radius < 1) {
		return;	
	}

	x = 0;
	y = radius;
	p = 3-2*radius;

	while ( x <= y ) {

		fill_circlea(x,yc+y,c);
		fill_circlea(x,yc-y,c);
		fill_circlea(y,yc+x,c);
		fill_circlea(y,yc-x,c);
		
		if (p < 0) {
			p = p + 4 * x + 6;
		} else {
			p = p + 4 * ( x - y ) + 10;
			y --;
		}
		
		x++;
	}
}
/**
 *	Draw an outlined single colour circle 
 *
 * @param colour    - colour
 * @param xc	    - x centre position
 * @param yc		- y centre position
 * @param radius	- radius of circle
 * @param c			- RGB colour
 *
 */
void OLEDDrawOutlineCircle( int xc,int yc, unsigned int radius , unsigned char c )
{
	int x, y, p;
	
	if ( !radius ) {
		return;	
	}

	x = 0;
	y = radius;
	p = 3 - 2 * radius;

	while ( x <= y ) {

		OLEDSetPixel(xc+x,yc+y,c);
		OLEDSetPixel(xc-x,yc+y,c);
		OLEDSetPixel(xc+x,yc-y,c);
		OLEDSetPixel(xc-x,yc-y,c);
		OLEDSetPixel(xc+y,yc+x,c);
		OLEDSetPixel(xc-y,yc+x,c);
		OLEDSetPixel(xc+y,yc-x,c);
		OLEDSetPixel(xc-y,yc-x,c);
		
		if (p < 0) {
			p = p + 4 * x + 6;
		} else {
			p = p + 4 * ( x - y ) + 10;
			y --;
		}
		
		x++;
	}
}
